zejun051019/2026-NUEDC-H-MSPM0G3507/empty.syscfg
ProjectConfig.genLibDrivers = true;
ProjectConfig.genLinker     = false;
ProjectConfig.genStartup    = false;
ProjectConfig.genOpts       = false;
ProjectConfig.genLibs       = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction4.peripheral.$suggestSolution           = "SYSCTL";
pinFunction4.peripheral.hfxOutPin.$suggestSolution = "PA6";
pinFunction6.peripheral.$suggestSolution           = "SYSCTL";
pinFunction6.peripheral.lfxInPin.$suggestSolution  = "PA3";
pinFunction6.peripheral.lfxOutPin.$suggestSolution = "PA4";
Board.peripheral.$suggestSolution                  = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution         = "PA20";
Board.peripheral.swdioPin.$suggestSolution         = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution       = "PB9";
GPIO1.associatedPins[1].pin.$suggestSolution       = "PA13";
GPIO1.associatedPins[2].pin.$suggestSolution       = "PA12";
GPIO1.associatedPins[3].pin.$suggestSolution       = "PB26";
GPIO2.associatedPins[0].pin.$suggestSolution       = "PB11";
GPIO2.associatedPins[1].pin.$suggestSolution       = "PB24";
GPIO2.associatedPins[2].pin.$suggestSolution       = "PA28";
GPIO2.associatedPins[3].pin.$suggestSolution       = "PA31";
GPIO2.associatedPins[4].pin.$suggestSolution       = "PB21";
GPIO3.associatedPins[0].pin.$suggestSolution       = "PB20";
GPIO3.associatedPins[1].pin.$suggestSolution       = "PA14";
GPIO3.associatedPins[3].pin.$suggestSolution       = "PA2";
GPIO4.associatedPins[0].pin.$suggestSolution       = "PB18";
GPIO4.associatedPins[1].pin.$suggestSolution       = "PB17";
GPIO5.associatedPins[0].pin.$suggestSolution       = "PA30";
GPIO5.associatedPins[1].pin.$suggestSolution       = "PB1";
GPIO6.associatedPins[0].pin.$suggestSolution       = "PB4";
GPIO6.associatedPins[1].pin.$suggestSolution       = "PA8";
GPIO6.associatedPins[2].pin.$suggestSolution       = "PB5";
GPIO6.associatedPins[3].pin.$suggestSolution       = "PA9";
GPIO6.associatedPins[4].pin.$suggestSolution       = "PA10";
GPIO6.associatedPins[5].pin.$suggestSolution       = "PB15";
GPIO6.associatedPins[6].pin.$suggestSolution       = "PA11";
GPIO6.associatedPins[7].pin.$suggestSolution       = "PB16";
GPIO7.associatedPins[0].pin.$suggestSolution       = "PB22";
I2C1.peripheral.$suggestSolution                   = "I2C1";
PWM1.peripheral.$suggestSolution                   = "TIMA0";
PWM2.peripheral.$suggestSolution                   = "TIMG7";
UART1.peripheral.$suggestSolution                  = "UART0";
UART2.peripheral.$suggestSolution                  = "UART1";
UART3.peripheral.$suggestSolution                  = "UART2";
UART4.peripheral.$suggestSolution                  = "UART3";
